app/controllers/order_items_controller.rb

SELECT "order_items".* FROM "order_items"
---
  def index
    @order_items = OrderItem.all

SELECT  "orders".* FROM "orders" WHERE (8) LIMIT 1
INSERT INTO "order_items" ("quantity", "product_id", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["quantity", 1], ["product_id", 2], ["order_id", 1], ["created_at", "2015-12-27 12:41:06.956646"], ["updated_at", "2015-12-27 12:41:06.956646"]]
INSERT INTO "orders" ("status", "created_at", "updated_at") VALUES (?, ?, ?)  [["status", "unsubmitted"], ["created_at", "2015-12-27 11:18:09.962778"], ["updated_at", "2015-12-27 11:18:09.962778"]]
---
  def create
    @order_item = @order.order_items.new(quantity: 1, product_id: params[:product_id])

    respond_to do |format|
      if @order_item.save

DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 3]]
---
  def destroy
    @order_item.destroy

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_order_item
      @order_item = OrderItem.find(params[:id])